//This Hunting Query is to Look for Known RMM Tool executions in the Environment with reconnaissance

let rmm = dynamic(["Action1.exe", "AddigyAgent.exe", "AeroAdmin.exe", "Alpemix.exe", "AmmyyAdmin.exe", "AnyDesk.exe", "AnyplaceControl.exe", "AnyViewer.exe", "AteraAgent.exe", "AuvikService.exe", "AweSunClient.exe", "BarracudaRMM.exe", "BeamYourScreen.exe", "BeAnywhere.exe", "BeyondTrustRemoteSupport.exe", "BlueTraitAgent.exe", "Chrome Extension (No process)", "ScreenConnect.Client.exe", "CrossLoop.exe", "CrossTecRemote.exe", "DWRCC.exe", "DattoRMM.exe", "DeskDay.exe", "DesktopNow.exe", "DistantDesktop.exe", "DWAgent.exe", "EHorusAgent.exe", "ElectricAgent.exe", "FleetDeck.exe", "GetScreen.exe", "IperiusRemote.exe", "isl_alwayson.exe", "ItarianAgent.exe", "JumpCloud.exe", "AgentMon.exe", "LevelRMM.exe", "LiteManager.exe", "LogMeIn.exe", "MeshAgent.exe", "mRemoteNG.exe", "MSP360RemoteDesktop.exe", "nagent.exe", "NaveriskAgent.exe", "Client32.exe", "NinjaRMM.exe", "OptiTuneAgent.exe", "Panorama9Agent.exe", "Parsec.exe", "PcVisit.exe", "PDQDeployConsole.exe", "Pulseway.exe", "Radmin.exe", "vncserver.exe", "vncviewer.exe", "RemoteDesktopPlus.exe", "RemotePCService.exe", "RemoteUtilities.exe", "RPort.exe", "RustDesk.exe", "ScreenMeet.exe", "ServerEye.exe", " Serv-u",  "ShowMyPC.exe", "SimpleHelpClient.exe", "SplashtopRemote.exe", "SupRemo.exe", "SyncroMSPAgent.exe", "SyspectrAgent.exe", "TacticalAgent.exe", "TechInline.exe", "vncserver.exe", "tvnserver.exe", "TSPlusService.exe", "UltraViewer.exe", "XMRealityAgent.exe", "ZohoAssist.exe"]);

DeviceNetworkEvents
| where Timestamp > ago(30d)
| where InitiatingProcessFileName has_any(rmm)
| where InitiatingProcessCommandLine has_any ("cmd.exe", "whoami", "ping", "systeminfo", "net.exe", "net share", "tasklist" ,"net group", "domain admin", " sctasks", "nltest" , "findstr", "hostname" , "quser", " driverquery", "pwsh.exe", "powershell")
